---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..IsElementValidIntersectingReference Method
PartMakerMethodToDivideVolumes Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | IsElementValidIntersectingReference(ElementId) | Identifies if the provided member is valid. |
|  | IsElementValidIntersectingReference(Document, ElementId) | Identifies if the provided member is valid. |

# See Also

PartMakerMethodToDivideVolumes Class

PartMakerMethodToDivideVolumes Members

Autodesk.Revit.DB Namespace